[
  {
    "isMainConsultancy": true,
    "from": "09/2023",
    "companyName": "Kanexa",
    "position": "Javascript Engineering Consultant",
    "companyLogo": "/images/company-logos/kanexa.svg",
    "tags": ["Startup", "FinTech", "Web3"],
    "location": "London (Remote)",
    "skills": [
      "Worked across multiple projects using a mixture of Typescript, Node, NextJS, React, GoLang, Styled Components and Storybook.",
      "Led the UI function of an internal finance management tool.",
      "Planned, architected, built, deployed and managed governance on a centralised component library for use across multiple products.",
      "Built CI/CD pipelines using Github Actions and Azure Devops for the testing and deployment of artifacts and services.",
      "Integrated commit message standards to ensure automated deployment versions for both artifacts and applications using semantic releases.",
      "Architected and built a gated deployment strategy for Cloudflare Pages",
      "Assisted building containerised services for Kubernetes Clusters.",
      "Worked closely with product, design and the wider directorate to give regular updates on timelines, progress, limitations, issues and recommendations on practices to help drive and foster a better working collaboration between teams.",
      "Integrated automated tests suites for accessibility and code quality alongside tooling for testing and maintaining required standards.",
      "Architected and implemented a secure authorisation strategy using Azure Entra and OIDC."
    ]
  },
  {
    "isMainConsultancy": true,
    "from": "10/2021",
    "to": "09/2023",
    "companyName": "Redkite Intelligence",
    "position": "Javascript Engineering Consultant",
    "companyLogo": "/images/company-logos/redkite.svg",
    "tags": ["Startup"],
    "location": "London (Remote)",
    "skills": [
      "Led the Front-End function on an internal data pipeline observation startup built with Typescript, React, GraphQL, Apollo, WebSockets, Styled Components and Storybook.",
      "Designed and architected a GraphQL solution over websockets with Apollo.",
      "Migrated separate repositories into a single, concise and easily maintained monorepo using Turborepo.",
      "Improved build processes and times, increasing performance and productivity using esbuild.",
      "Integrated CI/CD pipelines and build processes in Azure Devops."
    ]
  },
  {
    "isMainConsultancy": true,
    "from": "03/2021",
    "to": "10/2021",
    "companyName": "Debut Careers",
    "position": "Javascript Engineering Consultant",
    "companyLogo": "/images/company-logos/debut.png",
    "tags": ["Startup"],
    "location": "London (Remote)",
    "skills": [
      "Managed and worked on a new pivotal feature using machine learning to speed up student applications for roles utilising NodeJS, typescript, React (SSR’d with NextJS)",
      "Designed and built a resilient serverless stack in GCP to accommodate the new API’s and front-end requirements.",
      "Maintained and manipulated data across multiple SQL and noSQL stores to help maintain and drive new functionality."
    ]
  },
  {
    "isMainConsultancy": false,
    "from": "04/2021",
    "companyName": "Vsourcing",
    "position": "Javascript Engineering Consultant",
    "companyLogo": "/images/company-logos/vsourcing.svg",
    "tags": ["Startup"],
    "location": "Nottingham (Remote)",
    "skills": [
      "Designed, developed and deployed the brochure website built on headless WordPress connected to a React, GraphQL and Styled Components driven UI.",
      "Managed marketing efforts on social media channels including Facebook, Instagram and LinkedIn.",
      "Managed PPC campaigns for SERPs and technical SEO audits and changes.",
      "Integrated payment systems with Stripe through the Stripe SDK and front-end libraries.",
      "Designed and built a bespoke online account area and live chat system."
    ]
  },
  {
    "isMainConsultancy": true,
    "from": "11/2020",
    "to": "03/2021",
    "companyName": "ModelDrive",
    "position": "Contract Lead Full-Stack Javascript Engineer",
    "companyLogo": "/images/company-logos/modeldrive.png",
    "tags": ["Startup", "FinTech", "SaaS"],
    "location": "London (Remote)",
    "skills": [
      "Worked on spreadsheet collaboration software utilising React, GraphQL, Apollo, WebSockets, Styled Components and Storybook.",
      "Ensured future-proofing and improved cycle speed by migrating to a centralised, component-based model and simplifying existing structures.",
      "Migrated from Redux/Kea to Apollo GraphQL on both the server and client.",
      "Consulted with existing developers on best practice and structures.",
      "Put forward architectural guidance to ensure performance and scalability."
    ]
  },
  {
    "from": "01/2020",
    "to": "11/2020",
    "companyName": "Just Eat",
    "companyLogo": "/images/company-logos/just-eat.svg",
    "position": "Contract Full-Stack Javascript Developer",
    "skills": [
      "Worked on all major Just Eat verticals including Home, Orders, Restaurants and Offers utilising VueJS, VueX, .NET, and Sass transpiled with Babel 7 and bundled with Webpack 4.",
      "Contributed to the Just Eat open-source library utilising lerna and storybook published through private npm.",
      "Helped upskill existing teams on modern coding practices (ES6/ES7/Components/Vue).",
      "Worked closely with directors and stakeholders to align expectations and regularly feedback on progress across the teams.",
      "Assisted QE with testing approaches for E2E, component and unit tests."
    ],
    "tags": ["Enterprise", "FTSE100", "Global"],
    "location": "Worldwide"
  },
  {
    "isMainConsultancy": false,
    "from": "09/2020",
    "to": "01/2021",
    "companyName": "Lifts To",
    "position": "Full-Stack Javascript Consultant",
    "companyLogo": "/images/company-logos/liftsto.jpg",
    "skills": [
      "Created a centralised component monorepo centered around React.",
      "Setup and configured existing and new components in Private NPM.",
      "Upskilled team members with new processes surrounding versioning and deployment.",
      "Created a bespoke Date Time Picker component deployed on Private NPM for use across internal and external business systems."
    ]
  },
  {
    "isMainConsultancy": false,
    "from": "01/2020",
    "companyName": "WPHP",
    "position": "Full-Stack Javascript Consultant",
    "companyLogo": "/images/company-logos/wphp.png",
    "tags": ["Startup", "SaaS"],
    "location": "Worldwide",
    "skills": [
      "Created a SaaS reporting suite using SSR React in NextJS integrated with a Koa back-end through GraphQL connected to a Postgres database.",
      "Created and implemented Apollo GraphQL from client through to back-end.",
      "Integrated CI/CD pipelines using terraform on AWS architecture.",
      "Interfaced with Stripe payment services and developed a bespoke internal platform for billing cycles, notifications, invoice handling and permission checks.",
      "Performed UX research studies and put forward guidance in regards to design and UI interaction."
    ]
  },
  {
    "from": "08/2019",
    "to": "01/2020",
    "companyName": "Boots",
    "companyLogo": "/images/company-logos/boots.png",
    "position": "Contract Full-Stack Javascript Developer (Technical Lead)",
    "skills": [
      "Worked on a greenfield eCommerce project utilising Server-Side Rendered React, Redux, Node, Express, Styled components, Storybook transpiled with Babel 7 and bundled with Webpack 4.",
      "Created and maintained NodeJS microservices built with Express and put forward planning for moving to a middleware strategy to aid reusability and centralisation.",
      "Performed regular site audits and put forward strategies for defect and tech debt mitigation.",
      "Worked as a tech lead across five teams providing insight and guidance on ways of working, agile methodology, testing strategy, CI/CD strategy. development best practices and microservice architecture.",
      "Upskilled existing teams on modern coding practices (ES6/ES7/React Hooks).",
      "Worked closely with directors and stakeholders to align expectations and regularly feedback on progress across the teams",
      "Built internal NPM packages to assist with development and testing"
    ],
    "tags": [],
    "location": "Nottingham"
  },
  {
    "from": "07/2018",
    "to": "08/2019",
    "companyName": "Dunelm",
    "companyLogo": "/images/company-logos/dunelm.png",
    "position": "Contract Full-Stack Javascript Developer (Technical Lead)",
    "skills": [
      "Re-architected www.dunelm.com using Lerna, React (with server-side rendering), Redux, Node, Express and Emotion written in ES6/ES7, transpiled with Babel and compiled with Webpack.",
      "Architected and built back-office systems utilising AWS, Cloudformation, Lambda, SNS, SQS and API Gateway using NodeJS and Koa middleware in Typescript.",
      "Put forward guidance to aid the integration of GraphQL utilising AppSync and Apollo Client.",
      "Implemented a behavioural unit test library with Jest and React testing library with mock adapters.",
      "Integrated javascript automation tests with TestCafe and Browserstack",
      "Integrated CI/CD pipelines in Jenkins and Docker in ECS"
    ],
    "tags": ["FTSE250", "eCommerce"],
    "location": "Leicester"
  },
  {
    "from": "09/2016",
    "to": "07/2018",
    "companyName": "Experian",
    "companyLogo": "/images/company-logos/experian.png",
    "position": "Contract Full-Stack Javascript Developer",
    "skills": [
      "Worked on four greenfield projects across four teams including customer servicing and price comparison utilising React, NextJS, Node, Express and Styled Components written in ES6/ES7, transpiled with Babel and compiled with Webpack",
      "Integrated with RESTful Micro-Services utilising Axios and Isomorphic Fetch",
      "Helped implement the initial workings of a component library with React components in Storybook",
      "Worked on unit test integration using Mocha and Enzyme with mocks built in Fetchmock and SinonJS",
      "Integrated with CI/CD pipelines in Jenkins and Travis",
      "Implemented automation tests and visual regression tests using Nightwatch and BackstopJS",
      "Aided teams with Agile methodology and strategy"
    ],
    "tags": ["FTSE100", "FinTech"],
    "location": "Nottingham, London and Costa Mesa"
  },
  {
    "from": "01/2015",
    "to": "09/2016",
    "companyName": "Capital One",
    "companyLogo": "/images/company-logos/capital-one.png",
    "position": "Senior Front-End software Engineer",
    "skills": [
      "Worked on a greenfield account servicing product utilising NodeJS, GraphQL, Angular, Gulp, NPM and Bower",
      "Worked closely with services teams to help craft RESTful API's",
      "Implemented unit tests with Jasmine and Karma and UI tests in Protractor",
      "Created a strict set of CSS/Sass guidelines that were applied to both the UK and US business, aiding collaboration and consistency between teams",
      "Upskilled other internal teams with brown bag sessions",
      "Built an internal component system “OneUI” that was utilised across 80 teams in the UK and US businesses"
    ],
    "tags": ["FTSE250", "FinTech"],
    "location": "Nottingham, London and North Virginia"
  },
  {
    "from": "09/2013",
    "to": "01/2015",
    "companyName": "Fifteen Design",
    "companyLogo": "/images/company-logos/fifteen.jpg",
    "position": "Lead Web Developer",
    "skills": "Worked closely alongside the design and SEO department to develop and deploy future-proof, UX-Oriented Content Managed websites and eCommerce solutions utilising semantic HTML5, CSS3, SCSS, PHP, Javascript, jQuery and XML to create compliant, accessible and responsive online products",
    "location": "Nottingham and London"
  }
]
